import HashTable from '@/utils/hashTable';

interface IMessage {
  [code: string]: string;
}

const modalMsg=new HashTable();
modalMsg.put('a', '파일첨부 시 첨부 가능한 확장자는' + '\n' + 'jpg, jpeg, png 만 첨부 가능합니다.');
modalMsg.put( 'b', '이미지 사이즈 수정 후' + '\n' + '다시 등록해주세요.');

/*export const ModalMsg: IMessage = {
  'a': '파일첨부 시 첨부 가능한 확장자는' + '\n' + 'jpg, jpeg, png 만 첨부 가능합니다.',
  'b': '이미지 사이즈 수정 후' + '\n' + '다시 등록해주세요.',
  'c': '첨부파일 용량을 확인 후' + '\n' + '다시 등록해주세요.',
  'd': '등록하신 이미지를' + '\n' + '삭제하시겠습니까?',
  'e': '수정 하시겠습니까?',
  'f': '정상적으로 수정 되었습니다.',
  'g': '수정을 실패하였습니다.',
  'h': '삭제를 실패하였습니다.',
  'i': '정말 삭제하시겠습니까?' + '\n' + '지금까지 작업한 내용이' + '\n' + '모두 삭제됩니다.',
  'j': '정상적으로 삭제 되었습니다.',
  'k': '종료 시점은 시작 시점보다' + '\n' + '빠를 수 없습니다.',
  'l': '정말 되돌리시겠습니까?' + '\n' + '작업 내용이 전부 삭제됩니다.',
  'm': '저장이 완료되었습니다.',
  'n': '저장을 실패하였습니다.',
  'o': '선택하신 이벤트를' + '\n' + '불러오시겠습니까?',
  'p': '정상적으로 등록되었습니다.',
  'q': '이벤트 불러오기를' + '\n' + '실패하였습니다.'
};*/

export { modalMsg };
